{"_path":"/pdf-optimizer/guide","_dir":"pdf-optimizer","_draft":false,"_partial":false,"_locale":"","title":"PDF Optimizer","description":"Optimize PDF documents for size, download & opening speeds, efficient printing and other options","icon":null,"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Introduction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF Optimizer is a command line tool for Windows or Linux 64-bit platforms that you can use to optimize PDF documents. With this product you can count on maximum file size reduction and enterprise-level accuracy and reliability. PDF Optimizer offers flexible control, allowing you to optimize your documents for a wide range of document workflows. You can optimize a PDF document so that it will download faster, open more quickly in a web browser or PDF viewer, print more efficiently, or be better suited for long-term preservation. Select exactly what type of content you prefer to preserve or discard, fine-tune image compression options, and optionally convert to a PDF/A or PDF/X standard.  With PDF Optimizer, you can ensure that your PDF documents will always be as small as possible while still meeting your needs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optimizing can also improve the performance of a PDF document without necessarily making that document smaller.  The optimization process can discard objects and features within a PDF document that require excess processing time. A complicated PDF document with a lot of features will tend to take more time to load, regardless of the size."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We provide detailed online documentation about PDF Optimizer and our other products at our Developer Resources site. Visit "},{"type":"element","tag":"a","props":{"href":"https://docs.datalogics.com/PDFOptimizer","rel":["nofollow"]},"children":[{"type":"text","value":"https://docs.datalogics.com/PDFOptimizer"}]},{"type":"text","value":" to learn more."}]},{"type":"element","tag":"h3","props":{"id":"what-you-get-when-you-buy-pdf-optimizer"},"children":[{"type":"text","value":"What you get when you buy PDF Optimizer"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A Windows or Linux command line tool for making PDF documents smaller or more efficient, or both"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The capacity to create and use JSON profile files, each one providing a list of settings for processing PDF documents from a command line or as part of an automated workflow. JSON, or JavaScript Object Notation, is an open standard file format that relies on easily readable English text, and it is used as an alternative to XML."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Technical support from our team of digital document specialists and professionals.  You can contact your Datalogics Support representative directly by electronic mail or visit our support site for this product."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Regular software updates"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Comprehensive user documentation, provided as a PDF file and online at our Developer Resource site."}]}]},{"type":"element","tag":"h3","props":{"id":"how-to-use-pdf-optimizer"},"children":[{"type":"text","value":"How to use PDF Optimizer"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can run PDF Optimizer from a command prompt, and manually optimize one PDF document at a time.  You can add a PDF Optimizer command to a batch or shell script file to automate the process. This way you can create a workflow that uses PDF Optimizer to optimize large numbers of PDF documents automatically.  You can use your favorite scripting language to automatically generate a series of calls to PDF Optimizer, each with a unique name for the input PDF document and the output file. PDF Optimizer is a quick and easy way to convert a set of PDF files to make them easier to distribute."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When you run PDF Optimizer, the program takes the input PDF document you provide, optimizes it, and then saves it as a new output PDF document. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After PDF Optimizer finishes processing your document, you will see a summary statement describing how much the product has reduced the size of your source file, and what was changed or removed to make the output PDF document smaller. This summary appears by default, but if you don't need the summary you can disable it. You can also choose to generate an optional detailed Results Report, saved as a text file in a folder you select."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Both of these reports are designed to make PDF Optimizer easier for you to use. As soon as you use the software to optimize one of your PDF documents, the product can provide details for you about the results—how much space was saved by reducing the resolution of individual images in the original document, embedding fonts, and removing objects like thumbnails, annotations, and JavaScript code."}]},{"type":"element","tag":"h3","props":{"id":"the-pdf-optimizer-profile"},"children":[{"type":"text","value":"The PDF Optimizer Profile"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can provide a variety of custom settings to tell PDF Optimizer exactly how you want it to optimize each PDF document.  For example, you can make a PDF smaller by choosing to downsample the images found in that document.  Downsampling an image reduces the resolution of that image and reduces its size as well. You could add a setting to a profile file that tells PDF Optimizer to discard bookmarks or attachments within a PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The custom settings that you provide to PDF Optimizer to manage the process are all defined in a "},{"type":"element","tag":"em","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"profile"}]}]},{"type":"text","value":" file. The profile is a JSON file that you need to specify in the command line statement.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We provide a set of profile files with the product, including several for converting documents into PDF/A output.  These JSON files are stored in the OptimizationProfiles folder:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"compressionMedium.json. – This is the profile recommended for PDF documents to be optimized without a specific case in mind. It provides strong compression, and the loss in quality of images is minimal."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"compressionHigh.json – This profile is designed for maximum compression. For some documents this may mean a significant loss in the quality of images."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"compressionLow.json – This profile is designed for modest compression, and little to no loss in the quality of images."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Digimaster.json. – This profile color converts images within a PDF document to gray scale and downsamples any images greater than 600 DPI resolution to 600 DPI. This profile is intended to be used with Kodak Digimaster printers."}]}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"We provide a series of profiles designed to create an archived version of a document for long-term storage.* PDFA-1b.json. – Basic conformance with PDF/A archival standards.\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-2b.json. – Basic conformance with archival standards but revised for later versions of the PDF format. PDF/A-2 includes options for OpenType fonts, layers, attachments (which themselves must be PDF/A compliant) and JPEG 2000 image compression."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-2u.json. – Matches PDF/A-2b but also requires that all text in the document have Unicode mappings."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-3b.json. – Matches PDF/A-2b, except that it is possible to embed any kind of file in the PDF document. With PDF/A-3 a user can save an XML, CSV, CAD, spreadsheet, or other type of file in the PDF document and still conform to PDF/A standards.  The file embedded in the PDF/A-3 does not need to be converted to PDF/A itself."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-3u.json. – Matches PDF/A-3b, but also requires that all text in the document have Unicode mappings."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-4.json. – Based on PDF 2.0"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-4e.json. – Based on PDF 2.0 for Engineering documents"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFA-4f.json. – Based on PDF 2.0 for embedded files in any format"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFX-4.json. – Conformance with PDF/X-4 archival standard."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"PDFX-6.json. – Conformance with PDF/X-6 archival standard."}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"printing.json. This profile is recommended for PDF documents to be sent to a printer."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can update these files as you like, but the content of your profile file must be valid JSON content."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you want to create your own custom profile, you can base your work on one of the profiles provided with the software installation package. But we recommend that you save a copy of the original JSON file and rename it, and then edit this copy instead.  This way you will preserve the original JSON profile for later reference.  Also, if you install an updated version of the software, the installation process will overwrite the original file, and any changes you made to that file will be lost.  Besides saving your own copy of the profile, you might also want to create a backup of your edited JSON profile in a different directory."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can use a JSON validator, like JSONLint, to check your JSON syntax ("},{"type":"element","tag":"a","props":{"href":"https://jsonlint.com","rel":["nofollow"]},"children":[{"type":"text","value":"https://jsonlint.com"}]},{"type":"text","value":")."}]},{"type":"element","tag":"h3","props":{"id":"installing-pdf-optimizer-pdf-checker"},"children":[{"type":"text","value":"Installing PDF Optimizer: PDF Checker"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Note that when you install PDF Optimizer, you can also install a separate utility as well called PDF Checker. PDF Checker is a simple command line utility for 64-bit Windows and Linux platforms that allows you to quickly scan a PDF document or set of documents to look for problems, or to simply identify features within a document that are likely to get in your way if you want to use the PDF efficiently. Then, you can use this knowledge of your PDF documents to enhance them using PDF Optimizer.  The two tools are designed to work together."}]},{"type":"element","tag":"h3","props":{"id":"installing-pdf-optimizer-updating-the-activation-key"},"children":[{"type":"text","value":"Installing PDF Optimizer: Updating the Activation Key"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When you first purchase PDF Optimizer, you will receive an activation key, and you will be prompted to enter this key when you install the software.  In response PDF Optimizer generates a license file for you (pdfoptimizer.lic) and stores it in the software installation directory."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When your evaluation period ends, and you later receive a new activation key for PDF Optimizer, you will need to enter it as you did your original activation key when you first installed the product. You will be prompted to enter the activation key. Type or paste the key value as you did before. PDF Optimizer will update the license file for you, and you can continue to use the product."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Note that if you don’t enter the activation key value when you first install the product, or enter it incorrectly, you will be prompted to enter the value again the next time you run PDF Optimizer."}]},{"type":"element","tag":"h2","props":{"id":"command-syntax"},"children":[{"type":"text","value":"Command Syntax"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The command syntax for PDF Optimizer must include:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer       "},{"type":"element","tag":"tabsthe","props":{},"children":[]},{"type":"text","value":" executable file name"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"-i [--input]      /    name of the PDF Input fie you want to optimize"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"-o [--output]                    name you want to assign to the output PDF file"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"-j [--profile]                 name of the JSON profile file"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For each command line option, you can use the short (“-i”) or long (“-input”) notation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These parameters are optional:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         -q [--quiet]                        don’t display the results summary on the command line tool"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         -l [--log]                     save detailed results to an output text file"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A command statement for PDF Optimizer might look like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer –-input March_Report.pdf –-output March_ReportB.pdf -–profile compressionMedium.json"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You don’t need to include the path for any of these files if the input file and profile are stored in the same directory as the program executable, and if you save the output file to the same directory as well."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But you might want to draw an input file from one directory and save the output to another. In that event you need to provide the path as well as the file name. The examples that follow are for Windows:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer –-input C:\\Datalogics\\OptimizedFiles\\AnnualReport2016.pdf –-output C:\\Datalogics\\OutputFiles\\AnnualReport2016-B.pdf –-profile compressionMedium.json"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If any of the file or path names include spaces, use quotes around the name:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer –-input “C:\\Datalogics\\Optimized Files\\Annual Report 2016.pdf” –-output C:\\Datalogics\\OutputFiles\\AnnualReport2016-B.pdf –-profile C:\\Datalogics\\profiles\\images.json"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Note that PDF Optimizer allows for a command statement syntax that does not include the option notation, for compatibility with previous versions of the software. That is, you can leave out “--input” and “--output” if you already have this command syntax in place in your existing PDF Optimizer work flow. A command that simply lists the name and path of the input file, output file, and JSON profile might look like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer MarchReport2016.pdf MarchReport2016-B.pdf compressionMedium.json"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You will see a summary statement in your command line tool after you run the software to optimize a PDF document. If you would rather not see this statement, you can disable it with the optional \"-q\" (--quiet) parameter, like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer –-input March_Report.pdf --output March_ReportB.pdf --profile compressionMedium.json --quiet"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On the other hand, you can add a parameter to generate an optional Results Report, exported to a text (.txt) file, using the \"-l\" (--log) parameter.  Include name of the report file:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer –-input March_Report.pdf --output March_ReportB.pdf --profile compressionMedium.json --log MarchResults.txt"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you want to save the results report to a specific folder, include the path name for that folder in the command line statement:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfoptimizer –-input March_Report.pdf --output March_ReportB.pdf --profile compressionMedium.json --log C:\\Datalogics\\Results Report\\MarchResults.txt"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Note that you can use both the --quiet and --log parameters in the same statement if you like. That is, you can suppress the summary report that appears on your command line and generate a detailed output report at the same time."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Windows installation adds the location of the PDF Optimizer executable to the %PATH% in the Windows Environment Variables, so you can run “pdfoptimizer.exe” from anywhere.  For Linux, you need to add the location of the PDF Optimizer executable to your PATH variable."}]},{"type":"element","tag":"h2","props":{"id":"how-pdf-optimizer-processes-a-pdf-document"},"children":[{"type":"text","value":"How PDF Optimizer processes a PDF document"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When PDF Optimizer processes a PDF document, it follows a series of steps described below. You can define the settings involved in the optimization process, such as whether to remove embedded fonts and how much to compress images, in your JSON profile file. Also, several of the steps in the process are optional:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1.       Flattening transparencies found in the PDF input document (optional)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2.       Converting the colors in the PDF input document to a target color space, using a color profile and render intent provided by the user (optional)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"3.       Optimizing content, including images, fonts, objects, and user data, and then the objects are compressed as a part of the cleanup process."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"4.       Converting the optimized document so that it is compliant with the PDF/A or PDF/X specification (optional)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These steps are described in detail in this document."}]},{"type":"element","tag":"h2","props":{"id":"setting-up-your-profile"},"children":[{"type":"text","value":"Setting up your profile"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Your JSON profile file should include a list of settings that define exactly what kinds of changes you want to apply to your PDF document.  The PDF Optimizer offers a lot of different methods to optimize of a PDF document.  The options you select will depend on how you want to change your output PDF documents."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Suppose you have a PDF document that is 18 MB and you want to make it smaller so that the file will be easier to distribute online.  If you expect that your readers will be opening the file in a browser window, and it doesn’t matter if the photographs and diagrams in the document appear with a lower resolution, you could make the document smaller by aggressively compressing the images included in the file. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On the other hand, if you are working with a large PDF document that your customers are likely to want to print, but you want to make it smaller so that it downloads and prints more quickly, you probably want to leave the graphics alone.  They will need to appear as sharp as possible.  But you don’t need interactive content, like form fields, bookmarks, comments, or digital signatures.  You can use PDF Optimizer to remove items from the PDF document that will not appear on paper."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Consider building a PDF document that you intend for people to read on smart phones and other mobile devices.  In this case you want to compress the document so that it opens as quickly as possible.  So you would reduce the size of the images in this case as well, but given that the screens are a lot smaller than a laptop or desktop monitor, you can reduce the resolution of the images in the PDF document to be less than a PDF document that is intended for opening in a browser window."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"All of the settings for compressing a document are optional and are turned off by default.  That means then that a setting is only applied if it is included in the JSON file. Flag settings must be set to “ON.”  Settings that are turned off do not need to be defined in the JSON profile file.  So if you wanted to you could create a custom JSON file with only a single setting, to compress images. Your JSON file might only hold five or six lines of text.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Only use lowercase characters for the keys and values you add to the JSON file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The methods you can use to optimize a PDF document are sorted into different categories:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Images                                 When a PDF document is created that includes photographs, diagrams or drawings, the original graphic file, such as a JPEG photograph or a PNG image, become images in that PDF file.  You can enter settings in the JSON profile file to compress these color, gray scale, or black & white images. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fonts                                     PDF documents can travel with the fonts that they need to access to properly render text.  Font files can be embedded within the PDF itself.  That way, no matter what machine is used to open a PDF file, the PDF is always guaranteed to look the same, and the viewing tool does not need to look for substitute fonts installed on the local desktop or laptop.  But these embedded font files can make the PDF larger, maybe a lot larger, if the document needs to express characters from an Asian font set, like Mandarin or Japanese. You can enter settings in your JSON profile file to remove individual font characters or sets that you don’t need, thus reducing the size of the PDF file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Transparency                     It is possible to stack objects, such as graphics, images, text boxes, and form fields, on top of each other on a PDF document.  These objects can be partially or fully transparent, and thus can interact in various ways with objects behind them. If a set of transparencies are stacked in a PDF file, each one contributes to the final result that appears on the page, such as the colors blending together into a final color that appears."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                                                To make a PDF document simpler you can flatten these transparencies.  The flattening process combines the layers of content on a PDF page, or a stack of transparent images or colors, and renders the result as a single image, blended color, or set of text.  For example, if a digital signature is flattened, the digital certificate key and related properties are removed from the signature field. The name of the person who signed the document and related information, such as the date and time stamp and the signer’s email address, appear on the page as text, but the signature field is no longer interactive. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                                                To flatten the transparencies within a PDF document, there needs to be a \"transparency/quality\" section in the JSON profile file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Objects                                Besides graphic images and font files, a variety of other objects can be saved within a PDF document.         "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Blocks of JavaScript code"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Thumbnail images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Bookmarks"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Tags"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Alternate graphics images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                                                PDF Optimizer is designed to allow you to remove any of these objects from a PDF document. This serves to make the document smaller and easier to distribute."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"User Data                            It is possible to edit PDF documents using Adobe Acrobat and other viewing and editing tools.  For example, when reviewing the content in a PDF document, a user might want to add a comment.  It is also possible to attach external files to a PDF document so that the file is saved as a part of the PDF, or embed a hyperlink to a web page.  Finally, a user could add metadata.  PDF Optimizer can remove any of this content. It can also remove form fields, such as text boxes, check boxes, and radio buttons."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cleanup                               Use the Cleanup features in PDF Optimizer to set compression values for a PDF document.  You can compress the entire PDF document or parts of the content, and you can also remove redundant content or select a compression method to use, as well as other changes designed to make a PDF document open more quickly."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"General                                These options affect the PDF document as a whole, rather than individual features, like images or fonts or bookmarks. The setting provided under General allows you to force PDF Optimizer to generate a PDF output document even if this document will be larger than the input document it is intended to replace."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Color Conversion             You can turn on this feature to direct PDF Optimizer to convert the colors in a PDF document to a color profile you select before optimizing that document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF/A Conversion           A PDF/A, or PDF Archive document, is a type of PDF file that is designed to be stored so that it can be accessed for many years to come.  PDF/A documents must be able to be opened and read using viewing tools available in the future, so they are designed to be self-contained.  For example, all of the fonts used in a PDF/A document must be embedded within the PDF document itself for the file to be considered PDF/A compliant.  You can turn on this option and prompt PDF Optimizer to save a PDF file as PDF/A compliant after the document is optimized. You can also define the color space used and determine how PDF Optimizer respond to errors during the conversion process."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF/X Conversion            A PDF/X, is an ISO-standard version the PDF format. It’s a subset of the PDF standard that applies to Printing Workflows."}]},{"type":"element","tag":"h3","props":{"id":"images"},"children":[{"type":"text","value":"Images"}]},{"type":"element","tag":"h4","props":{"id":"downsampling-images"},"children":[{"type":"text","value":"Downsampling Images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you have images in a PDF document that you want to make smaller, and you know that these images don’t need to have a high resolution in the output file, you can reduce the resolution of these images.  You can also compress these images within the file.  Both steps will reduce the final size of the PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In PDF Optimizer, the process of reducing the resolution of images is called downsampling. You can choose to downsample color images in a PDF document, or grayscale, or monochrome (black & white). The settings for reducing the resolution for these three kinds of images in a PDF document must be added separately to the JSON profile file.  Each type of image can have its own settings and resolution values. So you could, for example, enable resampling to only apply to the color images in a PDF document. Or you could include only grayscale and black and white images."}]},{"type":"element","tag":"h5","props":{"id":"downsampling-and-recompression"},"children":[{"type":"text","value":"Downsampling and Recompression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Downsampling reduces the size of the image directly by reducing the resolution.  In recompression, compressed images in a document are decompressed and then compressed again.  You can enter a recompression setting to change the compression algorithm used for recompression, such as ZIP, JPEG or Flate, and another setting to change the final image quality. The image quality is part of the compression method used.  If you add settings in the JSON profile file to downsample images, PDF Optimizer will also recompress the images involved whether you provide recompression settings or not. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you do not add recompression settings to the JSON profile, PDF Optimizer downsamples and recompresses each image in the PDF document using the default compression algorithm and quality value defined in the image itself. For example, if you provide downsample settings but not recompression settings in your JSON profile and apply that profile to a document that only holds images using JPEG compression, PDF Optimizer will use the JPEG compression method. It will also use the highest quality recompression setting available (“maximum”) to keep from reducing the quality of the images as they are recompressed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On the other hand, if you decide to leave out downsample settings from your JSON profile file, but add recompression settings, PDF Optimizer recompresses the images using the recompression algorithm you provide while keeping the image downsampling resolution (DPI) the same.  Note that if you add recompression settings you must include both values in the JSON file, the compression algorithm and the recompression quality level."}]},{"type":"element","tag":"h5","props":{"id":"image-resolution"},"children":[{"type":"text","value":"Image Resolution"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When we refer to the resolution of an image, we generally refer to the number of pixels in that image. This can be expressed in terms of megapixels, or in Dots per Inch (DPI).  With an image in a PDF document, the resolution of the image is expressed as a certain number of pixels wide and pixels high. The downsampling process involves changing the width and height of an image in pixels, in order to reach a given target resolution.  PDF Optimizer calculates the resolution for every image in the document. Keep in mind that the resolution values used with downsampling are distinct from the image quality settings used for image recompression. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can specify a target resolution to use for downsampling images in a document (target-dpi) and a trigger resolution (trigger-dpi).  If you decide to downsample an image type, both the target and the trigger resolution settings must be included in your profile file.  The target resolution defines the goal—the maximum resolution for every image in the file. So if you add a target resolution to your JSON profile and set that target resolution to 600 DPI, PDF Optimizer will downsample every graphic in the PDF document to 600 DPI unless it that image is already at 600 DPI or less. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The trigger resolution, if used, defines the resolution PDF Optimizer uses as its starting point.  Any image with a resolution greater than the trigger resolution will be downsampled.  If an image has a resolution less than the trigger resolution, PDF Optimizer ignores it. So if you set the trigger resolution to 800 DPI, and the target resolution to 400 DPI, it means that you want to downsample every image in the PDF document to 400 DPI, but only if the image is larger than 800 DPI to begin with.  In this example you would be telling PDF Optimizer to look for only the really large images (the ones with a resolution at 800 DPI or more) and then downsample just those images to a certain set value, in this example 400 DPI."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If the trigger resolution is 500 DPI, and the target resolution is 400 DPI, PDF Optimizer will not downsample an image if it is 480 DPI.  But if the trigger resolution is 500 and the target is 400, if PDF Optimizer finds an image with a resolution of 680 DPI, it will downsample it to 400 DPI."}]},{"type":"element","tag":"h5","props":{"id":"a-few-examples-of-json-profile-settings"},"children":[{"type":"text","value":"A Few Examples of JSON Profile Settings"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This example shows settings used to downsample and recompress color JPEG images in a PDF document:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"        \"color\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            \"downsample\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"trigger-dpi\": 225,"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"target-dpi\": 150"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            \"recompress\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"type\": \"jpeg\","}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"quality\": \"medium\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            }"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"        },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Here images with a resolution above 225 DPI will be resized to 150 DPI, using the JPEG compression algorithm, and set at \"medium\" quality.  The quality levels (low, medium, high) are defined within the JPEG algorithm itself. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In this example, we don’t provide recompress settings."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"        \"color\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            \"downsample\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"trigger-dpi\": 225,"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"target-dpi\": 150"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"        },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF Optimizer will use the same compression algorithm, JPEG, because these types of images are by default JPEG compressed.  But the quality setting will be \"Maximum\" because the software tries to maintain the same level of compression quality as found in the original JPEG images.   "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finally, consider this example:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"        \"color\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            \"downsample\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"trigger-dpi\": 225,"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"target-dpi\": 150"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            \"recompress\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"type\": \"zip\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                \"quality\": \"medium\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"            }"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"        },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This refers to the same type of image in the PDF document, color JPEG images.  PDF Optimizer will downsample the color images to 150 DPI if they are above 225 DPI, but uses the ZIP compression algorithm, rather than using the default JPEG compression method."}]},{"type":"element","tag":"h4","props":{"id":"images-color"},"children":[{"type":"text","value":"Images: Color"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"downsample"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ability to specify a target resolution and a trigger resolution at which color images will be recompressed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"trigger-dpi"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"All color images above this resolution will be downsampled."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"target-dpi"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The new resolution of downsampled color images."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"recompress"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sets the type and quality of compression used to downsample color images. JPEG compression is a compression format commonly used for photographs.  It uses a technique known as DCT, Discrete Cosine Transform."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"same"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Keep original default compression algorithm provided in the images themselves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"zip"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use ZIP compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"jpeg"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use JPEG compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"jpeg2000"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use JPEG2000 compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"zip-jpeg"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use both ZIP and JPEG compression for the images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These values are valid for JPEG and JPEG2000 compression only:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"minimum"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"low"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"medium"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"high"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"maximum"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"lossless"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Original quality of the graphic is preserved (see Monochrome). Only available for JPEG2000."}]},{"type":"element","tag":"h4","props":{"id":"images-grayscale"},"children":[{"type":"text","value":"Images: Grayscale"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"downsample"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ability to specify a target resolution and a trigger resolution at which grayscale images will be recompressed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"trigger-dpi"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"All grayscale images above this resolution will be downsampled."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"target-dpi"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The new resolution of downsampled grayscale images."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"recompress"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sets the type and quality of compression used to downsample grayscale images.  JPEG compression is a compression format commonly used for photographs.  It uses a technique called DCT, Discrete Cosine Transform."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"same"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Keep original default compression algorithm provided in the images themselves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"zip"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use ZIP compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"jpeg"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use JPEG compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"jpeg2000"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use JPEG2000 compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"zip-jpeg"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use both ZIP and JPEG compression for the images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These values are valid for JPEG and JPEG2000 compression only:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"minimum"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"low"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"medium"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"high"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"maximum"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"lossless"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Original quality of the graphic is preserved (see Monochrome). Only available for JPEG2000."}]},{"type":"element","tag":"h4","props":{"id":"images-monochrome"},"children":[{"type":"text","value":"Images: Monochrome"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"downsample"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ability to specify a target resolution and a trigger resolution at which monochrome images will be recompressed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"trigger-dpi"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"All monochrome images above this resolution will be downsampled."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"target-dpi"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The new resolution of resampled monochrome images."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"recompress"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sets the type and quality of compression used to downsample  monochrome images."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"JBIG2 is a compression algorithm designed for binary images, or images where each pixel can only have one of two possible colors. It can be used for either lossy or lossless image processing."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"CCITT Group 4 refers to the compression type from the International Telegraph and Telephone Consultative Committee (CCITT) or TIU. Many fax and document imaging file formats support this form of lossless data compression encoding. These protocols are referred to as CCITT Group 3 and Group 4 compression, respectively."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lossy and lossless refer to the approach used for compressing data. For lossless, all of the data in the image is preserved. The quality of the image does not change, and it can be uncompressed to its original state. Lossy compression permanently removes data from the image file, such as pixels, reducing the image resolution. Files reduced using lossy compression will be considerably smaller, but will not print or display as well as those compressed using lossless compression."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"same"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Keep original default compression algorithm provided in the images themselves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"jbig2"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use jbig2 compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ccittg3"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use ccittg3 compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ccittg4"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use ccittg4 compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"lossy"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Valid for jbig2 only"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"lossless"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Valid for jbig2 only"}]},{"type":"element","tag":"h4","props":{"id":"images-color-grayscale-or-monochrome"},"children":[{"type":"text","value":"Images: Color, Grayscale, or Monochrome"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable any of these values by adding it to the profile and setting it equal to ON."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"optimize-images-only-if-reduction-in-size"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Set this value to ON if you want PDF Optimizer to only downsample an image found in a PDF document if the newly downsampled image is in fact smaller than the original. When recompressing an image, the output file can possibly expand in size.  If the process yields an image that is the same size as the original, or larger, PDF Optimizer will leave the image alone."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"consolidate-duplicate-image-and-forms"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remove duplicate copies of alternate images and forms."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"down-convert-16-to-8-bpc-images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When enabled, images that are 16 bits per component will be converted to 8 bits per component."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The color depth of an image is the number of bits used per pixel for each color component. RGB, for example, has three color components.  By down-converting an image in a PDF file from 16 bpc to 8 bpc, you are reducing the resolution of the image, but also significantly reducing its size. If a PDF document features high-resolution images, the final PDF can also be significantly smaller."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This feature is not applicable if Color Conversion is enabled (see page 18). Color Conversion will attempt to down-convert 16 bpc images automatically if you turn it on. The down-convert feature only has an impact if Color Conversion is turned off."}]},{"type":"element","tag":"h3","props":{"id":"fonts"},"children":[{"type":"text","value":"Fonts"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable any of these values by adding it to the profile and setting it equal to ON."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"subset-embedded-fonts"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Subsetting fonts removes unused characters from font files embedded in the PDF. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It is a best practice when working with PDF documents to embed every font used in that document into the document itself. That way, the viewing tool (like Acrobat) does not have to look for a font on the local system, or choose a substitute. But embedding font files in a PDF document can make the PDF quite large, especially if the PDF has embedded a font file for an Asian language, such as Mandarin, with tens of thousands of glyphs.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A glyph is a symbol that represents a character in a font.  For example, Times Roman has its own a glyph for the letter “a,” as does Helvetia, Courier, and Tempus sans.  The single letter, lower case a, could be expressed in a PDF file as any one of hundreds of different kinds of glyphs. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To avoid this, a subset of the glyphs in the font can be saved in the PDF document. The subset font only includes the characters you expect to need when rendering the pages of that document. This often leads to a much smaller PDF."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"consolidate-duplicate-fonts"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remove multiple copies of the same font file. Sometimes PDF documents are created with multiple copies of the same font, either as multiple subsets or multiple, fully embedded copies of a font file. When multiple copies of the same font appear, they may be merged into a single font."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"unembed-standard-14-fonts"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remove the Base 14 fonts.  The Base 14 fonts are:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Times Roman"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Helvetica"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Courier"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Symbol"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Times Roman bold"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Helvetica bold"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Courier bold"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         ZapfDingbats"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Times Roman italic"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Helvetica oblique"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Courier oblique"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Times Roman bold/italic"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Helvetica bold/oblique"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"·         Courier bold/oblique"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When these standard fonts are embedded in a PDF document they can make the file larger."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"resubset-subset-fonts"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Allows already subset fonts to be re-subset if possible (see “subset-embedded-fonts” above).  Subsetting can significantly reduce the size of the PDF document if a font features thousands of glyphs, such as Mandarin. By re-subsetting a subset font in a PDF document, you are replacing it with a subset that will only contain the glyphs currently in use in the document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Suppose you have a long PDF document that uses Mandarin characters. You decide to create a summary version of this file by deleting all but the first two pages. After re-subsetting, the Mandarin characters that no longer appear in the document are removed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"remove-unused-fonts"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes fonts that are embedded but not being used in the document."}]},{"type":"element","tag":"h3","props":{"id":"transparency"},"children":[{"type":"text","value":"Transparency"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To flatten transparencies in a PDF input document, add one of these \"quality\" settings to your JSON profile file. If you don't include the \"quality\" setting in your JSON profile, PDF Optimizer will not flatten transparencies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Note that the printing.json JSON profile included with PDF Optimizer provides the \"transparency\" section at the end of the file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The resolution level to use when flattening transparent objects. The higher the level of quality, the better the final output in print or in a browser window. But the resulting PDF document will also be larger."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"low-quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Line art and text 288 DPI, gradients 144 DPI"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"medium-quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Line art and text 300 DPI, gradients 150 DPI"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"high-quality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Line art and text 1200 DPI, gradients 300 DPI"}]},{"type":"element","tag":"h3","props":{"id":"objects"},"children":[{"type":"text","value":"Objects"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable any of these values by adding it to the profile and setting it equal to ON."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-javascript-actions"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes JavaScript content. Blocks of JavaScript code can be added to a PDF to complete a function or calculate a value, such as a user’s age when that person enters his or her birth date in a form field. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-alternate-images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes alternate versions of the same image found in the PDF document. A PDF document can be set up to specify alternate images, or multiple versions of one image within the same document. These images can be used to meet different needs. For example, a PDF could present one image with a lower resolution for display on a monitor, and an alternate image with a higher resolution to use when the PDF document is sent to a printer. These images can make a PDF document very large.  Today alternate images are rarely used."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-thumbnails"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes document thumbnails.  Thumbnail images are used to preview pages in a PDF document and appear in a panel on the left side of the viewer window.  A user could scroll through a series of thumbnails to find a page he or she is looking for."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-document-tags"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes document tags. Tags are sometimes added to PDF documents to provide  structural information to describe items such as headers and other content on a page. Tagging is generally used with a PDF document to meet accessibility requirements. For example, tags in a PDF document might be placed so that text, headings, footnotes, and other content in the document can be interpreted by a screen reading software tool."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-bookmarks"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes document bookmarks. Bookmarks make navigation easier.  They are typically presented as a Table of Contents, and are commonly attached to headings within the document. A user typically interacts with this Table of Contents to move directly to the part of the page where the bookmark is found.  And bookmarks can be used apart from a table of contents to mark a place in a PDF document to navigate to."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-output-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes the document’s output intent. The output intent is an entry in the PDF document OutputIntents array. The output intent is used to describe how the destination device for the document, most likely a printer, reproduces the colors in the document. Specifically, the output intent describes the ICC Color space to use for rendering the document. The ICC profile is stored in the PDF document itself. If the output intent is present, rendering will be to that profile. PDF documents that are compliant with an ISO standard, like Graphics Exchange (PDF/X), Archive (PDF/A), and Engineering (PDF/E), often have an output intent set."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As the ICC profile can be quite large, you might want to remove it to reduce the size of the PDF document, if you don’t have plans to print the document in the future. But if it is important to preserve color fidelity for your application, it should not be removed."}]},{"type":"element","tag":"h3","props":{"id":"user-data"},"children":[{"type":"text","value":"User data"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable any of these values by adding it to the profile and setting it equal to ON."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-comments-forms-multimedia"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes interactive elements from the PDF document. These can include annotations, such as pop-up notes, comments, and highlights, as well as interactive Acrobat form fields and embedded multimedia. Besides removing the interactive elements, this option also removes the visual content associated with these elements."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-xmp-metadata-padding"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"XMP refers to the Extensible Metadata Platform, a standard created by Adobe Systems to guide the creation, processing, and exchange of metadata for a variety of digital resources. When XMP metadata is included in a PDF document, the application that creates the PDF leaves a “padding area” in the text stream, commonly 2 to 4 KB for each set of XMP metadata. This allows for the metadata to be edited in place, and expanded if needed, without disturbing the document as a whole. This option removes the XMP padding from the document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-document-information-and-metadata"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes document descriptions and metadata. A minimal set of information will be maintained to ensure maximum compatibility with PDF viewers and processors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-file-attachments"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes files attached to the document"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-external-crossreferences"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes references to external data. This would include links to external resources, like a photograph or another PDF document that could be downloaded from a web page or FTP site.  This option effectively removes the hyperlinks to these items."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-private-data"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes piece data relevant to the application that created the file. Some applications, like Adobe Illustrator, add their own unique content to a PDF document when generating that document.  This information is useful to the original software product if the PDF is opened and edited in that product again.  But this information can be removed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"discard-hidden-layer-content"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Layers in a PDF document allow content to be placed above or below other content. The content in layers can be hidden from view, so that, for example, copyright information provided on the bottom of a page does not appear in Adobe Reader but is included if the document sent to a printer. The layers in a PDF document can be displayed in the Layers panel in Adobe Acrobat.  You can remove this hidden content to reduce the size of a PDF document."}]},{"type":"element","tag":"h3","props":{"id":"cleanup"},"children":[{"type":"text","value":"Cleanup"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Selects the compression action for the file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"compress-entire-file"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Compress document as a single unit"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"compress-document-structure"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Compress the document structure only"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"remove-compression"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes compression from file streams"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable any of these values by adding it to the profile and setting it equal to ON."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"flate-encode-uncompressed-streams"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Compress uncompressed streams using flate."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"convert-lzw-to-flate"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Recompress LZW-compressed streams using flate."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"optimize-page-content"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Removes redundant content streams, or page text."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"optimize-for-fast-web-view"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Place all the information needed to render the first page of the document near the beginning of the file. This is also known as linearization."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Flate, or Deflate compression, is an open source standard widely used for creating zip files and in PDF documents. It is commonly used for PNG image files, and is much more widely used than LZW."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"LZW, Lempel-Ziv-Welch, is a universal data compression algorithm, once widely used with Unix platforms. This method appears in some old PDF documents but it is rarely used any longer."}]},{"type":"element","tag":"h3","props":{"id":"general"},"children":[{"type":"text","value":"General"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable either of these values by adding it to the profile."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"preserve-version"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If this value is set to off, PDF Optimizer saves the output PDF document to PDF version 1.7."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you set this value to “on,” PDF Optimizer preserves the original version of the PDF source document if possible. If you select an option for PDF Optimizer to use when optimizing your source PDF document that will conflict with the current version of the PDF document, PDF Optimizer will ignore your request to preserve the original version of the PDF source document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For example, if you want to use PDF Optimizer to process a PDF source document of version 1.5, and request that the version be preserved and also that the document be converted to PDF/A-3u format, the output will be 1.7 since it's required for PDF/A-3u output."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"write-output-even-if-increase-in size"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If this value is set to off, if PDF Optimizer finds that the output file will actually be bigger than the original PDF input file when it is finished processing, PDF Optimizer will not generate an output file at all.  Rather, it will write an error message saying that the file could not be optimized."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you set this value to “on,” PDF Optimizer generates the PDF output file even if the optimization process produces a document bigger than the input file it is meant to replace."}]},{"type":"element","tag":"h3","props":{"id":"color-conversion"},"children":[{"type":"text","value":"Color Conversion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable this value by adding it to the profile and setting it equal to ON."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We can see thousands of different shades of colors, and high-quality digital cameras and scanners can often detect millions of shades.  To manage the broad range of colors for producing graphics images in digital content, imaging professionals have developed models to define these colors, called color spaces."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Many color spaces have been defined.  Some are dependent on hardware devices, and define what a camera can detect, or a printer print, or a monitor display. Others are based on software and thus can be used across many different types of devices, such as Adobe RGB or sRGB (standard RGB).  A color space must be defined for any device or software product to make sure that coloring patterns remain the same from one device or system to another."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Standard RGB color space, sRGB, was developed by Microsoft and Hewlett Packard to describe colors available on most monitors and displays.  This color space is also commonly used for web graphics."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Adobe Systems’ own Adobe RGB (Red/Green/Blue) color space is designed to hold all of the colors that are likely to be available on any color CMYK (Cyan/Magenta/Yellow/Black) printer.  It is considerably larger than Standard RGB."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Color profiles are standards for managing colors, used to ensure that the colors for text or graphics in a file remain the same regardless of the hardware or software used to display, edit, or print that file. Color profiles are based on the specification created by the International Color Consortium (ICC) in 1993 to govern color and color management across all operating systems, platforms, and software and hardware and software systems.  A color profile is usually expressed as a file included in the software or driver for an installed printer, scanner, or other hardware device, or in software used to edit a file that is to be displayed or printed. A profile provides a set of data that describes an input or output device.  A color profile file can also be embedded in a PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"enabled"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Enables PDF Optimizer to convert colors in a PDF document using a target profile."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"convert-profile"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The profile used to convert colors in the PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"lab-d50"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"L*a*b color specification with a D50 white point. The Lab color space is based on the CIE XYZ color space, but it includes a dimension L, for lightness, along with "},{"type":"element","tag":"em","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"a"}]}]},{"type":"text","value":" and "},{"type":"element","tag":"em","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"b"}]}]},{"type":"text","value":" coordinates, to define the color. This is Adobe Systems’ standard Lab profile."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"srgb"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Standard RGB, the default profile for Windows monitors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"apple-rgb"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Apple RGB, the default profile for Mac monitors"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"color-match-rgb"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Color Match RGB. This is a simpler version of the Radius ColorMatch RGB space, without the non-zero black point."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"gamma-18"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Gray Gamma 1.8, grayscale display profile, used for content viewed on a monitor"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"gamma-22"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Gray Gamma 2.2"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"dot-gain-10"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Grayscale printer profile, with dot gain 10%. Dot gain is commonly used in offset printing to define the increase in size in halftone dots in the printing process, making a printed document look darker than intended."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"dot-gain-15"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dot gain 15%"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"dot-gain-20"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dot gain 20%"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"dot-gain-25"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dot gain 25%"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"dot-gain-30"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dot gain 30%"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"monitor-rgb"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"RGB Monitor, referring to a monitor that requires separate signals for the three primary colors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"acrobat5-cmyk"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Adobe Reader 5 CMYK"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"acrobat9-cmyk"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Adobe Reader 9 CMYK"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The above list of options represents the standard list of color profiles provided with PDF Optimizer.  These color profiles are in the form of .icc profile files, and these files are stored in this directory after the product is installed:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF Optimizer\\Resources\\Color\\Profiles"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you enter one of these options, PDF Optimizer can find the correct color profile file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you want to use your own custom color profile file, provide the full path name where the file is stored. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We recommend that you put your color profile file in the same \\Resources  directory where the other color profile files are stored, but you can store it wherever you like."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you want to apply your own color profile, the convert-profile section of the JSON profile file might look like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"         \"color-conversion\": {"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                 \"enabled\": \"on\","}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                 \"color-convert-action\": \"convert\","}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                 \"convert-intent\": \"profile-intent\","}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                 \"convert-profile\": \"C:\\Datalogics\\PDF                       Optimizer\\Resources\\Color\\                             Profiles\\custom_profile.icc\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"         },"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"color-convert-action"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The type of color conversion. The values available include convert and decalibrate. The decalibrate setting means that PDF Optimizer will decalibrate calibrated color spaces in the PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If a color profile file is assigned to a PDF document, or to a feature in of that PDF document, such as an image, the document or image is referred to as “calibrated.” This color profile will be used when rendering colors for that document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If a color profile is not assigned to the document, a default color profile is used instead, usually installed on the local device or on a printer. So, if you select decalibrate as the color-conversion-option, you can remove the ICC profile file stored in the PDF document, and thus reduce the size of the PDF output file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"convert-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use this setting to specify the color translation method for colors that are outside the gamut of the color profile.  The intent lets the software determine how to substitute a color that can be written to the file.  You can select from a list of standard strategies to apply when converting the colors in that original PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The conversion intent is used to describe how the destination device for the document reproduces the colors in the document. Thus, when you print or display the PDF output file, the colors in the output file will match as closely as possible the original color found in the source PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"perceptual-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Generally used for photography. This method does not map colors one for one but estimates to match colors. Hence it often provides the most pleasing result but not necessarily the most accurate."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"relative-colorimetric-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Generally used for photography. The relative method uses an algorithm to select the closest possible color map to be true to the specified color."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"saturation-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Commonly used in charts and diagrams with a limited palette of colors where hue is not as important."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"absolute-colorimetric-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Often used to select a specific color or set of colors for drawings or designs. Absolute serves to reproduce the exact colors provided in the original PDF document. A common reason for using absolute would be to reproduce the color used in a corporate logo such as IBM Blue. The color is changed by selecting a defined match. This method does not use a conversion algorithm to select the closest color available."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"profile-intent"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you specify a color profile in the convert-profile option the intent value defaults to that profile. In that case software will use the rendering intent provided with the ICC color profile currently in use for that PDF document.  For example, the Adobe RGB 1998 color profile uses Relative Colormetric as its rendering intent. So if you specify Adobe RGB 1998 (srgb) as the color profile, and profile-intent is selected here, the PDF Optimizer software will use relative."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"object-type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Use this setting to specify what type of objects are included in the color conversion process.  This allows for more granular control over what types of objects are included or not during conversion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"all"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Include all object types (images, text, line-art, and shading) during color conversion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"images"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Include images during color conversion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"text"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Include text during color conversion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"line-art"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Include line-art during color conversion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"shading"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Include smooth shadings during color conversion."}]},{"type":"element","tag":"h3","props":{"id":"pdfa-conversion"},"children":[{"type":"text","value":"PDF/A Conversion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable this category by adding it to the profile and setting “enabled” equal to on.  This setting directs PDF Optimizer to save an optimized PDF document so that it is compliant with the PDF/A format. Other settings in this category allow you to control to conversion process and select the output type."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF/A, or PDF Archive, is an ISO-standard version the PDF format. Adobe introduced PDF in 1993, and the International Organization for Standardization (ISO) took management of PDF as an open standard in 2008. ISO released PDF/A in 2005. PDF/A is designed to be used with PDF files that need to be archived and stored, and still capable of being opened and read in a viewing tool many years into the future. Hence the standards for PDF/A files differ from regular PDF documents. In one example, to be PDF/A compliant, the fonts in a PDF/A file must be embedded in the file itself so that a viewer does not need to try to access fonts stored in a font directory on a local machine."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"enabled"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Enables conversion of the optimized PDF document to the PDF/A  format."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Select the type of PDF/A output to use for the target file:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1b"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Basic conformance with PDF/A archival standards"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2b"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Basic conformance with archival standards but revised for later versions of the PDF format. PDF/A-2 includes options for OpenType fonts, layers, attachments (which themselves must be PDF/A compliant) and JPEG 2000 image compression."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2u"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Matches PDF/A-2b but also requires that all text in the document have Unicode mapping."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"3b"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Matches PDF/A-2b, except that it is possible to embed any kind of file in the PDF document. With PDF/A-3 a user can save an XML, CSV, CAD, spreadsheet, or other type of file in the PDF document and still conform to PDF/A standards.  The file embedded in the PDF/A-3 does not need to be converted to PDF/A itself."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"3u"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Matches PDF/A-3b, but also requires that all text in the document have Unicode mapping."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"4"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Based on PDF 2.0"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"4e"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Based on PDF 2.0 for Engineering documents."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"4f"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Based on PDF 2.0 for embedded files in any format."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"pdfa-target-color-space"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Select the target color space to use when converting the colors in the PDF document when converting it to PDF/A."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"rgb"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"red green blue"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"cmyk"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"cyan magenta yellow black"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Rasterize-if-errors-encountered"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When set to OFF, if PDF Optimizer finds errors when saving the optimized PDF document as PDF/A compliant, PDF Optimizer ends the conversion to PDF/A and displays error message."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When set to ON, if PDF Optimizer finds errors when converting a PDF document, it will rasterize the page with the problem into a graphic image and continue to save the document as a PDF/A document."}]},{"type":"element","tag":"h3","props":{"id":""},"children":[{"type":"text","value":" "}]},{"type":"element","tag":"h3","props":{"id":"_1"},"children":[{"type":"text","value":" "}]},{"type":"element","tag":"h3","props":{"id":"_2"},"children":[{"type":"text","value":" "}]},{"type":"element","tag":"h3","props":{"id":"pdfx-conversion"},"children":[{"type":"text","value":"PDF/X Conversion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Optional. Enable this category by adding it to the profile and setting “enabled” equal to on.  This setting directs PDF Optimizer to save an optimized PDF document so that it is compliant with the PDF/X format. Other settings in this category allow you to select the output type."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"PDF/X, is an ISO-standard version the PDF format. It’s a subset of the PDF standard that applies to Printing Workflows."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"enabled"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Enables conversion of the optimized PDF document to the PDF/X format."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Select the type of PDF/X output to use for the target file:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"6"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Conformance with PDF/X-6"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"4"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Conformance with PDF/X-4"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"3"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Conformance with PDF/X-3"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1a"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Conformance with PDF/X-1a"}]},{"type":"element","tag":"h2","props":{"id":"windows-error-codes"},"children":[{"type":"text","value":"Windows Error Codes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1001               Syntax error.  You started PDF Optimizer but left out the name of your input PDF document, or the export document, or the profile, or otherwise made an error in your command syntax."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1002               Profile not found. PDF Optimizer could not find the profile file you named in your command statement.  Check the file name or path for errors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1003               Profile invalid. The JSON file you provided as the profile contains syntax errors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1004               Invalid flag value. PDF Optimizer found an unexpected value in the settings in your JSON profile.  Key values, such as “medium” or “jpeg” as well as the word “on” must always be in quotes, while numeric values must not have quotes.  This format would generate an error:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"target-dpi\": \"350\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                        This is the correct format. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"target-dpi\": 350"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                        Or if you leave out quotes, as if you meant to include a numeric value, that will also generate an error, like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"discard-javascript-actions\": on"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                        This is the correct format."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"discard-javascript-actions\": \"on\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1005               Input PDF document was not found."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1006               PDF Optimizer could not create output PDF document.  Verify that you have write permissions to the folder, that the file is not already open, and that the output file path name is valid."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1007               Input PDF document is signed or has usage rights and cannot be processed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1008               Unable to write to log file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1009               Syntax error.  You did not include the name of your input file in your command statement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1010               Syntax error.  You did not include the name of your profile file in your command statement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1011               Syntax error.  You did not provide a name for creating an output file in your command statement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1012               General processing error in creating output PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1013               The input file path is the same as the output file path."}]},{"type":"element","tag":"h2","props":{"id":"linux-error-codes"},"children":[{"type":"text","value":"Linux Error Codes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"101                 Syntax error.  You started PDF Optimizer but left out the name of your input PDF document, or the export document, or the profile, or otherwise made an error in your command syntax."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"102                 Profile not found. PDF Optimizer could not find the profile file you named in your command statement.  Check the file name or path for errors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"103                 Profile invalid. The JSON file you provided as the profile contains syntax errors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"104                 Invalid flag value. PDF Optimizer found an unexpected value in the settings in your JSON profile.  Key values, such as “medium” or “jpeg” as well as the word “on” must always be in quotes, while numeric values must not have quotes.  This format would generate an error:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"target-dpi\": \"350\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                        This is the correct format. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"target-dpi\": 350"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                        Or if you leave out quotes, as if you meant to include a numeric value, that will also generate an error, like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"discard-javascript-actions\": on"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"                        This is the correct format."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"       \"discard-javascript-actions\": \"on\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"105                 Input PDF document was not found."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"106                 PDF Optimizer could not create output PDF document.  Verify that you have write permissions to the folder, that the file is not already open, and that the output file path name is valid."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"107                 Input PDF document is signed or has usage rights and cannot be processed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"108                 Unable to write to log file."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"109                 Syntax error.  You did not include the name of your input file in your command statement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"110                 Syntax error.  You did not include the name of your profile file in your command statement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"111                 Syntax error.  You did not provide a name for creating an output file in your command statement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"112                 General processing error in creating output PDF document."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"113                 The input file path is the same as the output file path."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"what-you-get-when-you-buy-pdf-optimizer","depth":3,"text":"What you get when you buy PDF Optimizer"},{"id":"how-to-use-pdf-optimizer","depth":3,"text":"How to use PDF Optimizer"},{"id":"the-pdf-optimizer-profile","depth":3,"text":"The PDF Optimizer Profile"},{"id":"installing-pdf-optimizer-pdf-checker","depth":3,"text":"Installing PDF Optimizer: PDF Checker"},{"id":"installing-pdf-optimizer-updating-the-activation-key","depth":3,"text":"Installing PDF Optimizer: Updating the Activation Key"},{"id":"command-syntax","depth":2,"text":"Command Syntax"},{"id":"how-pdf-optimizer-processes-a-pdf-document","depth":2,"text":"How PDF Optimizer processes a PDF document"},{"id":"setting-up-your-profile","depth":2,"text":"Setting up your profile","children":[{"id":"images","depth":3,"text":"Images"},{"id":"fonts","depth":3,"text":"Fonts"},{"id":"transparency","depth":3,"text":"Transparency"},{"id":"objects","depth":3,"text":"Objects"},{"id":"user-data","depth":3,"text":"User data"},{"id":"cleanup","depth":3,"text":"Cleanup"},{"id":"general","depth":3,"text":"General"},{"id":"color-conversion","depth":3,"text":"Color Conversion"},{"id":"pdfa-conversion","depth":3,"text":"PDF/A Conversion"},{"id":"","depth":3,"text":" "},{"id":"_1","depth":3,"text":" "},{"id":"_2","depth":3,"text":" "},{"id":"pdfx-conversion","depth":3,"text":"PDF/X Conversion"}]},{"id":"windows-error-codes","depth":2,"text":"Windows Error Codes"},{"id":"linux-error-codes","depth":2,"text":"Linux Error Codes"}]}},"_type":"markdown","_id":"content:7.pdf-optimizer:1.guide.md","_source":"content","_file":"7.pdf-optimizer/1.guide.md","_stem":"7.pdf-optimizer/1.guide","_extension":"md"}